app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = current_user

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test Article "], ["body", "Testing if the user will be added or not"], ["user_id", 2], ["created_at", "2015-04-18 19:53:22.708791"], ["updated_at", "2015-04-18 19:53:22.708791"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "image" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image", "Rational-Ritual-11-800x600.jpg"], ["updated_at", "2015-04-25 16:25:57.926995"], ["id", 14]]

  def like

    valid_user = @article.likes.find_by(user: current_user)

    if valid_user

      like = @article.likes.find_by(user: current_user)

      if like.like
        like.like = false
        flash[:success] = "Changed to dislike"
      elsif !like.like
        like.like = true
        flash[:success] = "Changed to like"
      end

      like.save

    else

      like = Like.create(like: params[:like], user: current_user, article: @article)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."article_id" = ? AND "likes"."user_id" = 9 LIMIT 1  [["article_id", 9]]
UPDATE "likes" SET "like" = ? WHERE "likes"."id" = ?  [["like", "f"], ["id", 5]]
INSERT INTO "likes" ("like", "user_id", "article_id") VALUES (?, ?, ?)  [["like", "t"], ["user_id", 9], ["article_id", 9]]