app/controllers/users_controller.rb

INSERT INTO "users" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ali Salalah"], ["desc", "Good Guy from salalah"], ["created_at", "2015-04-15 20:55:36.839201"], ["updated_at", "2015-04-15 20:55:36.839201"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Ali Salalah mon"], ["updated_at", "2015-04-18 19:12:35.766089"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)